it/src/DataProcessors/АнализЖивогоИМертвогоСофта/АнализЖивогоИМертвогоСофта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АнализЖивогоИМертвогоСофта</name>
  <attributes>
    <name>ВариантОтчета</name>
    <type>
      <types>EnumRef.ВариантыАнализаЖивогоИМертвогоСофта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУстановлено</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУстановлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПрограммы</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

it/src/Enums/ВариантыАнализаЖивогоИМертвогоСофта/ВариантыАнализаЖивогоИМертвогоСофта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыАнализаЖивогоИМертвогоСофта</name>
  <enumValues>
    <name>АнализЖивогоСофта</name>
  </enumValues>
  <enumValues>
    <name>АнализМертвогоСофта</name>
  </enumValues>
</mdclass:Enum>

it/src/Documents/РаспределениеЛицензий/РаспределениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЛицензий</name>
  <registerRecords>AccumulationRegister.РазмещениеЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУстановлено</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/DataProcessors/АнализЖивогоИМертвогоСофта/Forms/Форма/Module.bsl
&наСервере	
Функция СформироватьРаспределениеНаСервере(СтруктураДокумента)
	
	НовыйДокумент = Документы.РаспределениеЛицензий.СоздатьДокумент();
	НовыйДокумент.Заполнить(СтруктураДокумента);
	
	НовыйДокумент.Дата = СтруктураДокумента.Дата;
	
	Для каждого ТабличнаяЧасть Из СтруктураДокумента.ТабличныеЧасти Цикл
		
		НовыйДокумент[ТабличнаяЧасть.Ключ].Загрузить(ТабличнаяЧасть.Значение);
		
	КонецЦикла;	
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		ОбновитьТаблицу();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;	
		
КонецФункции	

&наСервере	
Процедура СформироватьРаспределенияНаСервере()
	
	Если Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта Тогда
	
		//Сформируем массив организаций
		СтруктураОтбора = Новый Структура("Флаг", Истина);
		ТаблицаРезультата = Объект.ОсновныеСредства.Выгрузить(СтруктураОтбора);
		
		//ТаблицаРезультата.Свернуть("Организация", "");
		//МассивОрганизаций = ТаблицаРезультата.ВыгрузитьКолонку("Организация");
		МассивОрганизаций = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаРезультата, "Организация", Истина);
		
		Для каждого Организация Из МассивОрганизаций Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Флаг", Истина);
			СтруктураОтбора.Вставить("Организация", Организация);
			
			ОсновныеСредства = Объект.ОсновныеСредства.Выгрузить(СтруктураОтбора);
			
			СтруктураДокумента = Новый Структура;
			СтруктураДокумента.Вставить("Дата", ТекущаяДата());
			СтруктураДокумента.Вставить("Организация", Организация);
			СтруктураДокумента.Вставить("Ответственный", Пользователи.ТекущийПользователь());
			
			СтруктураДокумента.Вставить("ТабличныеЧасти", Новый Структура("ОсновныеСредства", ОсновныеСредства));
			
			НовыйДокумент = СформироватьРаспределениеНаСервере(СтруктураДокумента);
			
		КонецЦикла;	
	
	Иначе
		
	КонецЕсли;	
	
КонецПроцедуры //СформироватьРазмещениеНаСервере

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьРаспределенияНаСервере();
КонецПроцедуры //Сформировать

&НаСервере
Процедура ОбновитьТаблицу()
	
	Если Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта Тогда
		ТаблицаРезультата = Обработки.АнализЖивогоИМертвогоСофта.ЗаполнитьМертвыйСофт();
	Иначе
		ТаблицаРезультата = Обработки.АнализЖивогоИМертвогоСофта.ЗаполнитьЖивойСофт();	
	КонецЕсли;
	
	Объект.ОсновныеСредства.Загрузить(ТаблицаРезультата);
	
КонецПроцедуры //ОбновитьТаблицу	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантОтчета) Тогда
		Объект.ВариантОтчета = Перечисления.ВариантыАнализаЖивогоИМертвогоСофта.АнализМертвогоСофта;
	КонецЕсли;
	
	ОбновитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьТаблицу();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВыбор(Выбор)
	Для Каждого Строка Из Объект.ОсновныеСредства Цикл
		Строка.Флаг = Выбор;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьВыбор(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	УстановитьВыбор(Ложь);	
КонецПроцедуры
